// Задача №22.Работа в группах
// Напишите программу, которая принимает на вход
// число (N) и выдаёт таблицу квадратов чисел
// от 1 до N.
// ● 5 -> 1, 4, 9, 16, 25.
// ● 2 -> 1,4


Console.Clear();
System.Console.Write("Ведите число ");
int x1 = int.Parse(Console.ReadLine()!)!;


double result = Math.Sqrt((x2 - x1) * (x2 - x1) + (y2 - y1) + (y2 - y1));
System.Console.WriteLine(result);




